t21/Walnut_X/Packages/.cache/Keil.EFM32HGxxx_DFP.1.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>EFM32HGxxx_DFP</name>
  <description>Silicon Labs EFM32 Happy Gecko Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="1.2.0" date="2016-04-22">
      Updated device support files to V4.2.1.
      Updated emlib, emdrv to V4.2.1.
    </release>
    <release version="1.1.0" date="2015-07-31">
      Added EFM32HG_SLSTK3400A Blinky example.
      Added emlib support.
      Added datasheets, user manual.
      Updated device support files to V4.0.0.
      Changed Device Vendor to '"Silicon Labs:21".
      Updated and renamed Flash Algorithm to EFM32M0P.FLM.
    </release>
    <release version="1.0.0">
      First Release version of EFM32HG Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFM32HG</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFM32HG Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <processor Dclock="24000000"/>

      <book name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <book name="Documents/EFM32HG-RM.pdf"                    title="EFM32HG Reference Manual"/>
      <description>
Silicon Labs' USB-enabled EFM32 Happy Gecko 32-bit microcontroller family delivers the lowest USB power drain in the industry, enabling longer battery life and energy harvesting applications and offering up to 64 kB of flash memory with the added option of embedded USB connectivity and CPU speeds up to 25 MHz.
Based on the powerful ARM Cortex-M0+ core, the Happy Gecko family features innovative low energy techniques, short wake-up time from energy saving modes and a wide selection of peripherals, making it ideal for battery operated applications and other systems requiring high performance and low energy consumption.
      </description>

      <!-- ************************  Subfamily 'EFM32HG108'  **************************** -->
      <subFamily DsubFamily="EFM32HG108">
        <book name="Documents/EFM32HG108FXX_DataSheet.pdf" title="EFM32HG108 Data Sheet"/>

        <!-- *************************  Device 'EFM32HG108F32'  ***************************** -->
        <device Dname="EFM32HG108F32">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG108F32"/>
          <debug svd="SVD/EFM32HG/EFM32HG108F32.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32HG108F64'  ***************************** -->
        <device Dname="EFM32HG108F64">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG108F64"/>
          <debug svd="SVD/EFM32HG/EFM32HG108F64.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32HG110'  **************************** -->
      <subFamily DsubFamily="EFM32HG110">
        <book name="Documents/EFM32HG110FXX_DataSheet.pdf" title="EFM32HG110 Data Sheet"/>

        <!-- *************************  Device 'EFM32HG110F32'  ***************************** -->
        <device Dname="EFM32HG110F32">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG110F32"/>
          <debug svd="SVD/EFM32HG/EFM32HG110F32.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32HG110F64'  ***************************** -->
        <device Dname="EFM32HG110F64">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG110F64"/>
          <debug svd="SVD/EFM32HG/EFM32HG110F64.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32HG210'  **************************** -->
      <subFamily DsubFamily="EFM32HG210">
        <book name="Documents/EFM32HG210FXX_DataSheet.pdf" title="EFM32HG210 Data Sheet"/>

        <!-- *************************  Device 'EFM32HG210F32'  ***************************** -->
        <device Dname="EFM32HG210F32">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG210F32"/>
          <debug svd="SVD/EFM32HG/EFM32HG210F32.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32HG210F64'  ***************************** -->
        <device Dname="EFM32HG210F64">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG210F64"/>
          <debug svd="SVD/EFM32HG/EFM32HG210F64.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32HG222'  **************************** -->
      <subFamily DsubFamily="EFM32HG222">
        <book name="Documents/EFM32HG222FXX_DataSheet.pdf" title="EFM32HG222 Data Sheet"/>

        <!-- *************************  Device 'EFM32HG222F32'  ***************************** -->
        <device Dname="EFM32HG222F32">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG222F32"/>
          <debug svd="SVD/EFM32HG/EFM32HG222F32.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32HG222F64'  ***************************** -->
        <device Dname="EFM32HG222F64">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG222F64"/>
          <debug svd="SVD/EFM32HG/EFM32HG222F64.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32HG308'  **************************** -->
      <subFamily DsubFamily="EFM32HG308">
        <book name="Documents/EFM32HG308FXX_DataSheet.pdf" title="EFM32HG308 Data Sheet"/>

        <!-- *************************  Device 'EFM32HG308F32'  ***************************** -->
        <device Dname="EFM32HG308F32">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG308F32"/>
          <debug svd="SVD/EFM32HG/EFM32HG308F32.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32HG308F64'  ***************************** -->
        <device Dname="EFM32HG308F64">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG308F64"/>
          <debug svd="SVD/EFM32HG/EFM32HG308F64.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32HG309'  **************************** -->
      <subFamily DsubFamily="EFM32HG309">
        <book name="Documents/EFM32HG309FXX_DataSheet.pdf" title="EFM32HG309 Data Sheet"/>

        <!-- *************************  Device 'EFM32HG309F32'  ***************************** -->
        <device Dname="EFM32HG309F32">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG309F32"/>
          <debug svd="SVD/EFM32HG/EFM32HG309F32.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

