t21/Walnut_X/Packages/.cache/Keil.EFM32HGxxx_DFP.1.2.0.pdsc
      <component Cgroup="LED" Capiversion="1.00" condition="EFM32HG BSP">
        <description>LED interface for Silicon Labs EFM32HG-SLSTK3400A Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32HG_SLSTK3400A/Common/LED_SLSTK3400A.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="EFM32HG BSP">
        <description>Buttons interface for Silicon Labs EFM32HG-SLSTK3400A Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32HG_SLSTK3400A/Common/Buttons_SLSTK3400A.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board vendor="Silicon Labs" name="EFM32HG-SLSTK3400A" revision="Ver 1.0">
      <description>Silicon Labs EFM32HG Starter Kit</description>
      <image small="Boards/SiliconLabs/EFM32HG_SLSTK3400A/Documents/efm32hg-stk3400_small.png"/>
      <book category="overview"  name="https://www.silabs.com/products/mcu/32-bit/Pages/efm32hg-stk3400.aspx" title="EFM32HG-SLSTK3400A Web Page"/>
      <book category="manual"    name="Boards/SiliconLabs/EFM32HG_SLSTK3400A/Documents/EFM32HG-SLSTK3400A-QuickStartGuide.pdf" title="Quick Start Guide"/>
      <book category="schematic" name="Boards/SiliconLabs/EFM32HG_SLSTK3400A/Documents/efm32hg-stk3400-schematics.pdf"         title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Silicon Labs:21" Dname="EFM32HG322F64"/>
      <compatibleDevice deviceIndex="0" Dvendor="Silicon Labs:21" DsubFamily="EFM32HG322"/>
      <feature type="Button"     n="3"             name="Push-buttons: Reset, 2x User"/>
      <feature type="LED"        n="6"             name="LEDs: 4x Status, 2x User"/>
      <feature type="DIO"                          name="Breakout pads for easy access to I/O pins"/>
      <feature type="DIO"                          name="20 pin expansion header"/>
      <feature type="Touch"      n="2"             name="Capacitive touch pad"/>
      <feature type="GLCD"       n="1" m="128.128" name="Segment LCD"/>
      <feature type="PWR"        n="5"             name="USB Powered"/>
      <feature type="Batt"       n="1"             name="CR2032 battery"/>
      <feature type="ODbg"       n="1"             name="Onboard SEGGER J-Link USB debugger"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32HG_SLSTK3400A/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="EFM32HG-SLSTK3400A" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
